test_performance/registerv1.yml
config:
  target: "http://localhost:9001"
  http:
    timeout: 60
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 220
      arrivalRate: 50
      rampTo: 75
      name: Sustained load
    - duration: 120
      arrivalRate: 70
      name: Heavy
    - duration: 170
      arrivalRate: 25
      rampTo: 50
      name: Crash
  environments:
    dev:
      target: "http://localhost:9001"
    skipHeader: true
  processor: "./utils.js"
scenarios:
  - name: "Register user"
    flow:
      - function: "generateRandomData"
      - post:
          url: "/users"
          json:
            email: "{{ email }}"
            pass: "{{ pass }}"
            firstName: "pepe"
            lastName: "apellido"
            phone: "123456"
            job: 1
            institutionId: "10140142331292"
            provinceId: "06" # Buenos aires
            townId: "06840010009"
          afterResponse: "printErrorStatus"
        expect:
          - statusCode: 201
          - contentType: json
          - hasProperty: "created"