test_performance/support.yml
config:
  target: "http://localhost:9001"
  phases:
    - duration: 60
      arrivalRate: 5
      bame: Warm up
    # Los phases de abajo serian los de carga posta. Los dejo comentados hasta que tengamos bien los escenarios.
    # - duration: 120
    #   arrivalRate: 5
    #   rampTo: 50
    #   name: Ramp up load
    # - duration: 600
    #   arrivalRate: 50
    #   name: Sustained load
scenarios:
  - name: "Get support resources"
    flow:
      - get:
          url: "/support/areas"
      - get:
          url: "/support/institutions"